Documents/ЛБ_УстановитьЛомбардыВГруппу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановитьЛомбардыВГруппу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ГруппыЛомбардов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_УстановитьЛомбардыВГруппу/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("Группа", Группа);  
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, Группа = &Группа) КАК ЛБ_ГруппыЛомбардовСрезПоследних
	               |ГДЕ
	               |	НЕ ЛБ_ГруппыЛомбардовСрезПоследних.Регистратор = &Регистратор";
	ТаблицаЛомбардов = Запрос.Выполнить().Выгрузить();
	
	Движения.ЛБ_ГруппыЛомбардов.Записывать = Истина;   
	Для каждого стр Из ЭтотОбъект.Ломбарды Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", стр.Ломбард);
		СтрокиЛ = ТаблицаЛомбардов.НайтиСтроки(Отбор);  
		Если СтрокиЛ.Количество() = 0 Тогда
			Движение = Движения.ЛБ_ГруппыЛомбардов.Добавить();
		    Движение.Период = Дата; 
			Движение.Ломбард = Стр.Ломбард;
			Движение.Группа = ЭтотОбъект.Группа;
		КонецЕсли;  
	КонецЦикла;	
	
	//Для каждого стр Из ТаблицаЛомбардов Цикл 
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Ломбард", стр.Ломбард);
	//	СтрокиЛ = ЭтотОбъект.Ломбарды.НайтиСтроки(Отбор);  
	//	Если СтрокиЛ.Количество() = 0 Тогда
	//		Движение = Движения.ЛБ_ГруппыЛомбардов.Добавить();
	//	    Движение.Период = Дата; 
	//		Движение.Ломбард = Стр.Ломбард;
	//		Движение.Группа = Справочники.ЛБ_ГруппыЛомбардов.ЛомбардыВнеГрупп;
	//	КонецЕсли;  
	//КонецЦикла;	
КонецПроцедуры
